## Production: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 20 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                       NAME                                       |
|----------|----------------------------------------------------------------------------------|
| update   | `aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical`              |
|          | `aws_cloudwatch_metric_alarm.no-emails-sent-5-minutes-critical`                  |
|          | `aws_cloudwatch_metric_alarm.ses-bounce-rate-critical`                           |
|          | `aws_cloudwatch_metric_alarm.ses-bounce-rate-warning`                            |
|          | `aws_cloudwatch_metric_alarm.ses-complaint-rate-critical`                        |
|          | `aws_cloudwatch_metric_alarm.ses-complaint-rate-warning`                         |
|          | `aws_cloudwatch_metric_alarm.sqs-bulk-db-tasks-stuck-in-queue-critical`          |
|          | `aws_cloudwatch_metric_alarm.sqs-bulk-db-tasks-stuck-in-queue-warning`           |
|          | `aws_cloudwatch_metric_alarm.sqs-bulk-queue-delay-critical`                      |
|          | `aws_cloudwatch_metric_alarm.sqs-db-tasks-stuck-in-queue-critical`               |
|          | `aws_cloudwatch_metric_alarm.sqs-db-tasks-stuck-in-queue-warning`                |
|          | `aws_cloudwatch_metric_alarm.sqs-email-queue-delay-critical`                     |
|          | `aws_cloudwatch_metric_alarm.sqs-normal-db-tasks-stuck-in-queue-critical`        |
|          | `aws_cloudwatch_metric_alarm.sqs-normal-db-tasks-stuck-in-queue-warning`         |
|          | `aws_cloudwatch_metric_alarm.sqs-priority-db-tasks-stuck-in-queue-critical`      |
|          | `aws_cloudwatch_metric_alarm.sqs-priority-db-tasks-stuck-in-queue-warning`       |
|          | `aws_cloudwatch_metric_alarm.sqs-priority-queue-delay-critical`                  |
|          | `aws_cloudwatch_metric_alarm.sqs-priority-queue-delay-warning`                   |
|          | `aws_cloudwatch_metric_alarm.sqs-sms-stuck-in-queue-critical`                    |
|          | `aws_cloudwatch_metric_alarm.sqs-throttled-sms-stuck-in-queue-critical`          |
| recreate | `aws_sns_topic_subscription.alert_critical_us_east_1_to_opsgenie[0]`             |
|          | `aws_sns_topic_subscription.alert_critical_us_east_1_to_opsgenie_ok[0]`          |
|          | `aws_sns_topic_subscription.alert_critical_us_west_2_to_opsgenie[0]`             |
|          | `aws_sns_topic_subscription.alert_critical_us_west_2_to_opsgenie_ok[0]`          |
|          | `aws_sns_topic_subscription.alert_to_sns_to_opsgenie[0]`                         |
|          | `aws_sns_topic_subscription.alert_to_sns_to_opsgenie_ok[0]`                      |
| add      | `aws_cloudwatch_metric_alarm.sqs-send-throttled-sms-tasks-receive-rate-critical` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "healtheck-page-slow-response-critical" {
        id                        = "healtheck-page-slow-response-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.no-emails-sent-5-minutes-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "no-emails-sent-5-minutes-critical" {
        id                        = "no-emails-sent-5-minutes-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ses-bounce-rate-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ses-bounce-rate-critical" {
        id                        = "ses-bounce-rate-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ses-bounce-rate-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ses-bounce-rate-warning" {
        id                        = "ses-bounce-rate-warning"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ses-complaint-rate-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ses-complaint-rate-critical" {
        id                        = "ses-complaint-rate-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ses-complaint-rate-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ses-complaint-rate-warning" {
        id                        = "ses-complaint-rate-warning"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-bulk-db-tasks-stuck-in-queue-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-bulk-db-tasks-stuck-in-queue-critical" {
        id                        = "sqs-bulk-db-tasks-stuck-in-queue-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "missing"
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-bulk-db-tasks-stuck-in-queue-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-bulk-db-tasks-stuck-in-queue-warning" {
        id                        = "sqs-bulk-db-tasks-stuck-in-queue-warning"
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "missing"
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-bulk-queue-delay-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-bulk-queue-delay-critical" {
        id                        = "sqs-bulk-queue-delay-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-db-tasks-stuck-in-queue-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-db-tasks-stuck-in-queue-critical" {
        id                        = "sqs-db-tasks-stuck-in-queue-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "missing"
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-db-tasks-stuck-in-queue-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-db-tasks-stuck-in-queue-warning" {
        id                        = "sqs-db-tasks-stuck-in-queue-warning"
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "missing"
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-email-queue-delay-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-email-queue-delay-critical" {
        id                        = "sqs-email-queue-delay-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-normal-db-tasks-stuck-in-queue-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-normal-db-tasks-stuck-in-queue-critical" {
        id                        = "sqs-normal-db-tasks-stuck-in-queue-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "missing"
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-normal-db-tasks-stuck-in-queue-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-normal-db-tasks-stuck-in-queue-warning" {
        id                        = "sqs-normal-db-tasks-stuck-in-queue-warning"
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "missing"
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-priority-db-tasks-stuck-in-queue-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-priority-db-tasks-stuck-in-queue-critical" {
        id                        = "sqs-priority-db-tasks-stuck-in-queue-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "missing"
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-priority-db-tasks-stuck-in-queue-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-priority-db-tasks-stuck-in-queue-warning" {
        id                        = "sqs-priority-db-tasks-stuck-in-queue-warning"
        tags                      = {}
      ~ treat_missing_data        = "notBreaching" -> "missing"
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-priority-queue-delay-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-priority-queue-delay-critical" {
        id                        = "sqs-priority-queue-delay-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      ~ statistic                 = "Maximum" -> "Average"
        tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-priority-queue-delay-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-priority-queue-delay-warning" {
        id                        = "sqs-priority-queue-delay-warning"
      ~ statistic                 = "Maximum" -> "Average"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-send-throttled-sms-tasks-receive-rate-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs-send-throttled-sms-tasks-receive-rate-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "NumberOfMessagesReceived is more than the expected maximum rate for send-throttled-sms-tasks SQS queue"
      + alarm_name                            = "sqs-send-throttled-sms-tasks-receive-rate-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "eks-notification-canada-casend-throttled-sms-tasks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "NumberOfMessagesReceived"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 78
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sqs-sms-stuck-in-queue-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-sms-stuck-in-queue-critical" {
        id                        = "sqs-sms-stuck-in-queue-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-throttled-sms-stuck-in-queue-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-throttled-sms-stuck-in-queue-critical" {
        id                        = "sqs-throttled-sms-stuck-in-queue-critical"
      ~ insufficient_data_actions = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.alert_critical_us_east_1_to_opsgenie[0] must be replaced
-/+ resource "aws_sns_topic_subscription" "alert_critical_us_east_1_to_opsgenie" {
      ~ arn                             = "arn:aws:sns:us-east-1:296255494825:alert-critical-us-east-1:7d8c9e1f-2ae2-4015-beba-4f6f2c57962c" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      - delivery_policy                 = "" -> null
      ~ endpoint                        = (sensitive) # forces replacement
      - filter_policy                   = "" -> null
      ~ id                              = "arn:aws:sns:us-east-1:296255494825:alert-critical-us-east-1:7d8c9e1f-2ae2-4015-beba-4f6f2c57962c" -> (known after apply)
      ~ owner_id                        = "296255494825" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - redrive_policy                  = "" -> null
      - subscription_role_arn           = "" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.alert_critical_us_east_1_to_opsgenie_ok[0] must be replaced
-/+ resource "aws_sns_topic_subscription" "alert_critical_us_east_1_to_opsgenie_ok" {
      ~ arn                             = "arn:aws:sns:us-east-1:296255494825:alert-ok-us-east-1:3f06e049-1c64-4b98-bd34-a63e4e4c5649" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      - delivery_policy                 = "" -> null
      ~ endpoint                        = (sensitive) # forces replacement
      - filter_policy                   = "" -> null
      ~ id                              = "arn:aws:sns:us-east-1:296255494825:alert-ok-us-east-1:3f06e049-1c64-4b98-bd34-a63e4e4c5649" -> (known after apply)
      ~ owner_id                        = "296255494825" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - redrive_policy                  = "" -> null
      - subscription_role_arn           = "" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.alert_critical_us_west_2_to_opsgenie[0] must be replaced
-/+ resource "aws_sns_topic_subscription" "alert_critical_us_west_2_to_opsgenie" {
      ~ arn                             = "arn:aws:sns:us-west-2:296255494825:alert-critical-us-west-2:9cfefb81-8126-4064-950c-c96a6f583d26" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      - delivery_policy                 = "" -> null
      ~ endpoint                        = (sensitive) # forces replacement
      - filter_policy                   = "" -> null
      ~ id                              = "arn:aws:sns:us-west-2:296255494825:alert-critical-us-west-2:9cfefb81-8126-4064-950c-c96a6f583d26" -> (known after apply)
      ~ owner_id                        = "296255494825" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - redrive_policy                  = "" -> null
      - subscription_role_arn           = "" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.alert_critical_us_west_2_to_opsgenie_ok[0] must be replaced
-/+ resource "aws_sns_topic_subscription" "alert_critical_us_west_2_to_opsgenie_ok" {
      ~ arn                             = "arn:aws:sns:us-west-2:296255494825:alert-ok-us-west-2:de5a3f48-f8c8-4d77-8145-eac0e2b32a5a" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      - delivery_policy                 = "" -> null
      ~ endpoint                        = (sensitive) # forces replacement
      - filter_policy                   = "" -> null
      ~ id                              = "arn:aws:sns:us-west-2:296255494825:alert-ok-us-west-2:de5a3f48-f8c8-4d77-8145-eac0e2b32a5a" -> (known after apply)
      ~ owner_id                        = "296255494825" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - redrive_policy                  = "" -> null
      - subscription_role_arn           = "" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.alert_to_sns_to_opsgenie[0] must be replaced
-/+ resource "aws_sns_topic_subscription" "alert_to_sns_to_opsgenie" {
      ~ arn                             = "arn:aws:sns:ca-central-1:296255494825:alert-critical:7ea6e620-73b8-4695-ab80-845f01a95409" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      - delivery_policy                 = "" -> null
      ~ endpoint                        = (sensitive) # forces replacement
      - filter_policy                   = "" -> null
      ~ id                              = "arn:aws:sns:ca-central-1:296255494825:alert-critical:7ea6e620-73b8-4695-ab80-845f01a95409" -> (known after apply)
      ~ owner_id                        = "296255494825" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - redrive_policy                  = "" -> null
      - subscription_role_arn           = "" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.alert_to_sns_to_opsgenie_ok[0] must be replaced
-/+ resource "aws_sns_topic_subscription" "alert_to_sns_to_opsgenie_ok" {
      ~ arn                             = "arn:aws:sns:ca-central-1:296255494825:alert-ok:7bd77b94-83c9-4268-81f9-eb4327ef96b5" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      - delivery_policy                 = "" -> null
      ~ endpoint                        = (sensitive) # forces replacement
      - filter_policy                   = "" -> null
      ~ id                              = "arn:aws:sns:ca-central-1:296255494825:alert-ok:7bd77b94-83c9-4268-81f9-eb4327ef96b5" -> (known after apply)
      ~ owner_id                        = "296255494825" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - redrive_policy                  = "" -> null
      - subscription_role_arn           = "" -> null
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 20 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-sms-created-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
